sudo pip install PyMySQL

In [2]:
import pymysql
from sqlalchemy import create_engine

In [10]:
engine = create_engine('mysql+pymysql://root:123456789@localhost/publications')

In [11]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM employee', engine)

In [12]:
data.head()

      emp_id    fname minit      lname  job_id  job_lvl pub_id  hire_date
0  A-C71970F     Aria             Cruz      10       87   1389 1991-10-26
1  A-R89858F  Annette           Roulet       6      152   9999 1990-02-21
2  AMD15433F      Ann     M      Devon       3      200   9952 1991-07-16
3  ARD36773F  Anabela     R  Domingues       8      100   0877 1993-01-27
4  CFH28514M   Carlos     F   Hernadez       5      211   9999 1989-04-21

In [14]:
data.to_sql('employee2', engine, if_exists='replace', index=False)

In [15]:
#Cursors are objects that moves on rows and executes the queries/transactions

In [16]:
import pymysql.cursors  
connection = pymysql.connect(host='127.0.0.1',
                             user='root',
                             password='123456789',                             
                             db='publications',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)

In [17]:
data1 = pd.read_sql_query('SELECT * FROM employee', connection)
data1.head()

      emp_id    fname minit      lname  job_id  job_lvl pub_id  hire_date
0  A-C71970F     Aria             Cruz      10       87   1389 1991-10-26
1  A-R89858F  Annette           Roulet       6      152   9999 1990-02-21
2  AMD15433F      Ann     M      Devon       3      200   9952 1991-07-16
3  ARD36773F  Anabela     R  Domingues       8      100   0877 1993-01-27
4  CFH28514M   Carlos     F   Hernadez       5      211   9999 1989-04-21

In [18]:
q1 = "SELECT * FROM employee"

In [19]:
cursor = connection.cursor()
cursor.execute(q1)
x = cursor.fetchone()
# x = cursor.fetchall()
print(x)
# for row in cursor:
#     print(row)

{'emp_id': 'A-C71970F', 'fname': 'Aria', 'minit': '', 'lname': 'Cruz', 'job_id': 10, 'job_lvl': 87, 'pub_id': '1389', 'hire_date': datetime.datetime(1991, 10, 26, 0, 0)}

In [20]:
x = cursor.fetchall()
data1 = pd.DataFrame(x)
data1.head()

      emp_id    fname  hire_date  job_id  job_lvl      lname minit pub_id
0  A-R89858F  Annette 1990-02-21       6      152     Roulet         9999
1  AMD15433F      Ann 1991-07-16       3      200      Devon     M   9952
2  ARD36773F  Anabela 1993-01-27       8      100  Domingues     R   0877
3  CFH28514M   Carlos 1989-04-21       5      211   Hernadez     F   9999
4  CGS88322F   Carine 1992-07-07      13       64    Schmitt     G   1389

### More examples on querying

In [21]:
q2 = '''select sales.stor_id, count(title_id) as Items, count(distinct(sales.`ord_num`)) as NumberofOrders, 
SUM(sales.qty) as QuantitySold, stores.stor_name as StoreName
From sales
left join stores 
on sales.stor_id = stores.stor_id
group by sales.stor_id
order by SUM(sales.qty)'''

cursor = connection.cursor()
cursor.execute(q2)
x = cursor.fetchall()

data = pd.DataFrame(x)
data.head()

   Items  NumberofOrders QuantitySold            StoreName stor_id
0      2               2            8  Eric the Read Books    6380
1      3               3           60   Fricative Bookshop    7896
2      4               4           80             Bookbeat    8042
3      4               2           90         News & Brews    7067
4      2               2          125             Barnum's    7066

In [22]:
q3 = '''SELECT StoreName, Items/NumberofOrders AS AvgItems, QuantitySold/Items AS AvgQty
FROM (
select sales.stor_id, count(title_id) as Items, count(distinct(sales.`ord_num`)) as NumberofOrders, 
SUM(sales.qty) as QuantitySold, stores.stor_name as StoreName
From sales
left join stores 
on sales.stor_id = stores.stor_id
group by sales.stor_id
order by SUM(sales.qty)
)subquery'''

cursor = connection.cursor()
cursor.execute(q3)
x = cursor.fetchall()

data = pd.DataFrame(x)
data.head()

  AvgItems   AvgQty            StoreName
0   1.0000   4.0000  Eric the Read Books
1   1.0000  20.0000   Fricative Bookshop
2   1.0000  20.0000             Bookbeat
3   2.0000  22.5000         News & Brews
4   1.0000  62.5000             Barnum's

### Inserting values in a table in the Database

In [25]:
q4 =  "Insert into jobs(job_id, job_desc, min_lvl, max_lvl)"\
         + "values (%s, %s, %s, %s)"
cursor.execute(q4, (15, "Data Analyst", 10, 20) )
connection.commit()

IntegrityError: (1062, "Duplicate entry '15' for key 'PRIMARY'")

In [26]:
#Python uses %s as a "placeholder" for the parameter, 
#which is independent of the parameter type.

### Updating values in a table in the Database

In [27]:
q5 = "Update jobs set job_desc = %s where job_id = %s " 
cursor.execute(q5, ("Data Analyst/Data Scientist", 15 ) )
connection.commit()

### Deleting values from a table

In [28]:
q6 = "Delete from jobs where job_id = %s"
cursor.execute(q6,(14))
connection.commit()

In [29]:
data = cursor.callproc("author_data") 
print(data)

()

In [30]:
cursor.close()

## File objects

In [94]:
#Without the context manager 
file = open('/Users/himanshuaggarwal/ironhack/himanshu/data/vehicles/vehicles_pipe.txt','r')
'''Different options :
'r' - reading 
'w' - writing 
'a' - appending 
'r+' - reading and writing 
'''

In [95]:
print(file.name)

/Users/himanshuaggarwal/ironhack/himanshu/data/vehicles/vehicles_pipe.txt

In [ ]:
file.close()

In [ ]:
#It is important to close the file after we are finished working on the file
# In this case we have to explicitly close the file as if not closed, there can be 
#leaks in the data

## Using the context manager

In [103]:
with open('/Users/himanshuaggarwal/ironhack/himanshu/data/vehicles/vehicles_pipe.txt','r') as file:
    print(file.name)
#     for row in file:
#         print(row)
#     f = file.readline()
#     print(f)
    f = file.readlines(3)
    print(f)

/Users/himanshuaggarwal/ironhack/himanshu/data/vehicles/vehicles_pipe.txt
['Make|Model|Year|Engine Displacement|Cylinders|Transmission|Drivetrain|Vehicle Class|Fuel Type|Fuel Barrels/Year|City MPG|Highway MPG|Combined MPG|CO2 Emission Grams/Mile|Fuel Cost/Year\n']

In [9]:
with open('test','r+') as file:
#     f = file.readlines()
#     f = file.readline()
#     f = file.read(10)
    for line in file.readlines(2):
        print(line)
#     print(f)
#     print('\n')

World

In [11]:
with open('test','r+') as file:
    
    file.seek(0,2)
    file.write("World")
    f1 = file.readlines()
    print(f1)

[]

fp.seek(offset, from_what)
offset means how many positions you will move

From what provides point of reference:
0: means your reference point is the beginning of the file
1: means your reference point is the current file position
2: means your reference point is the end of the file
The default value is 0